{"userLikes":3636979,"talingAbout":18969,"itsLikes":[{"category":"App page","name":"Candy Crush Saga","id":"244944385603396"},{"category":"App page","name":"Farm Heroes Saga","id":"416898068399728"},{"category":"App page","name":"Papa Pear Saga","id":"475887905808784"},{"category":"App page","name":"Pet Rescue Saga","id":"205254879607280"},{"category":"App page","name":"Bubble Witch Saga","id":"148336855246835"}],"postNum":336,"postTop10":{"0":{"shares":31,"likes":25,"message":"Get ready pepper fans, AlphaBetty Saga is COMING SOON to Facebook!\n\nLike the official fan page for the latest fun-tastic updates --> http://to.king.com/UeYh","comments":{"0":{"user":"Tamme Williams","message":"game has not let me play AGAIN for days..... freezes on opening today which I suppose is better than taking lives and not letting you play at all? but dang, be nice if there wasn't so many problems, good game otherwise"},"1":{"user":"Denise Schell Maynard","message":"Game does not open up!!!!!!!!!!!!!!!!!!!!!! Please fix!"},"2":{"user":"Louise Taylor","message":"Pepper Panic - Nope cannot get passed the first screen. Just sits there doing nothing. Would love to play...."},"3":{"user":"Donna Herron","message":"As game developers I would think that your team would at least respond to  all of your game audience in regards to our questions concerning this game. Are you discontinuing it? Are you working on it? You ARE ignoring our comments and questions.....WHY? I have been playing this game for at least one year now and feel I (we) deserve an answer after having been a loyal player for so long! Please respond. Any response is better than none, no matter what the answer.....even to say sorry, we don't know what happened but we're aware of the issue and are working on it...... A lot of unhappy gamers on this thread right now, please toss out a reponse, thank you"},"4":{"user":"Donna Herron","message":"I don't want AlphaBetty..... FIX PEPPER PANIC!!!!!"},"5":{"user":"Sandy Stephens","message":"loads just fine for me but I'm at the end and I want MORE LEVELS NOT A NEW GAME!!!"},"6":{"user":"Carole Hymiller","message":"Ok, so I finished 460 rooms and the end of the game!  Bummer.  Are there any plans to add more?"},"7":{"user":"Scott Scharlau","message":"spemd less time creating cute animated cartoons and more time working out these bugs. The companies want us to BUY with actual MONEY from a application that does not work at the base level. Am i off base thinking thats insane. Its like going to Mac Shack getting the wrong order and them saying COME ON GUYS!!! BUY MORE STUFF EVEN THOUGH THE CHEESE BURGER HAD NO CHEESE OR BURGER!!!! wooohoooooo"},"8":{"user":"Denise Nanos","message":"Anyone from pepper panic reading these?"}}},"1":{"shares":550,"likes":25,"message":"Exclusive! See how your favorite King characters Release The Magic, in our brand new festive video!","comments":{"0":{"user":"Liz Carmona","message":"The game is not loading so i have not played in over a month."},"1":{"user":"Sharon Power","message":"not loading anyone else having loading issues"},"2":{"user":"Caroyl Murray Tussing","message":"Yes add more levels I;m at the end also .  Love the game."},"3":{"user":"Kelly Stewart","message":"Please add more levels Pepper Panic Saga, I have been at the end for months now and I saw that you intended that to be the last level but it is a very nice game and many enjoyed playing, can you get your techs on it and add more. I love this game and miss playing."},"4":{"user":"Betty Newman","message":"why do you not have a way for the players to post when there are problems with the game? The game loads and lets me send help but then after I click on the level I'm on the pepper just spins and spins. So if I refresh it will finally get to the game BUT I will have also lost all the extra lives I had been given!!! And I've already cleaned the cache. It is the game!! Fix this! We shouldn't lose all the extra lives just  because you have a gltch in the game."},"5":{"user":"Karen Wilson","message":"Hello I haven't been able to play the game as it wont load, is there a problem it constantly says loading and refreshing the page doesn't help no problem with any other games."},"6":{"user":"Rita Müller","message":"Pepper panic für Android"},"7":{"user":"Erica Bray","message":"Mobile App please"},"8":{"user":"Mary Welch","message":"My game won't load"}}},"2":{"shares":226,"likes":25,"message":null,"comments":{"0":{"user":"Nancy Thompson Small","message":"anybody else having trouble loading this game? I haven't played in several days because it won't finish loading"},"1":{"user":"Paulo Henrique Fer","message":"For Android Google PlayStore please."},"2":{"user":"Pity Garcia","message":"more levels 460!!!!!!!!!"},"3":{"user":"Kim Langley","message":",Best Game Out There. :Finnished level 460. Come on King New Levels Please:"},"4":{"user":"Amy Anderson Helton","message":"Please make this game available on Google Play, android or any phone"},"5":{"user":"Paweł Sobczyk","message":"Add me..!!"},"6":{"user":"Mariana Muñoz","message":"Android version PLEASE!!!!!!!"},"7":{"user":"Chrissy Hurst","message":"when will you have new levels, l love playing the game but lve run out of levels"},"8":{"user":"Soula Loupi","message":"More levels please!!!"}}},"3":{"shares":279,"likes":25,"message":null,"comments":{"0":{"user":"Bonnie Whitmore","message":"Make app for iPad and Android!!!!"},"1":{"user":"Jenny Montgomery","message":"Make a app for iPad kindle n iPhone"},"2":{"user":"Mary Yannone","message":"Need a app. For my ipad please !!!!"},"3":{"user":"David Sawyer","message":"what is wrong with this game, i have to lose to lives to play this game,i have over 200 of my friends playing this game and have the same issues.can you do something with this KING peeps or do we just pass the word around and find more games to play.thanks for letting me vent  just keep getting pissed off to try playing my favorite game."},"4":{"user":"Wendolyn Durley","message":"I want to play on my iPad mini and Android."},"5":{"user":"Leslie Giturmindright Burch","message":"Hurry up and get this for Android!!!"},"6":{"user":"Javier Torres","message":"Add me please I want this game"},"7":{"user":"Krista Johnson Schnittker","message":"App please!!!!!!!!!!!"},"8":{"user":"Wendolyn Durley","message":"I got a iPad mini and I miss some of the games not added to the iPads. Please add these games off of Facebook please."}}},"4":{"shares":29,"likes":25,"message":"Now through Dec. 7, Bubble Witch 2 Saga is partnering with (RED) to fight for an AIDS FREE GENERATION. 100% of proceeds from Gold Bars spent in these (RED) levels will go to (RED) 's fight against AIDS.\n\nBURST BUBBLES. SAVE LIVES-> http://to.king.com/pniP\n*App Store exclusive","comments":{"0":{"user":"Doris Miller","message":"Having issues with loading again. What is up with this game?"},"1":{"user":"Scott McFadden","message":"is anyone else having issues with this game loading levels tp play?"},"2":{"user":"Jeanne Vedstesen","message":"Pebber panic saga App for Android please :-)  it is allmost christmas ;-)"},"3":{"user":"Beverly Williams","message":"I really wish you all would take time to answer people on here! Pepper Panic Saga!! When or are you all ever going to add new levels to pepper panic or the ones finished with the level 460 just need to delete the app? I have already deleted my game but I am sure others would like to know as well! Typing I am sure for no reason! Thats why I play Royal Dice now and its the best game I have played in awhile since pepper panic is over!!"},"4":{"user":"George Remitrom","message":"Bubble Witch Saga is total shite! Don't know why you have 2 Bubble Witch games and are not making any new Pepper Panic levels! grrrr"},"5":{"user":"Nakita Earley Loudermilk","message":"App for ios for pepper saga please"},"6":{"user":"Emma Eniigma","message":"add me"},"7":{"user":"Ionelia Dinu","message":"pepper panic saga , when is ready for ANDROID ??????????????????"},"8":{"user":"Clara Fernandes","message":"Pepper Panic Saga  new  levels  461??????"}}},"5":{"shares":387,"likes":25,"message":"BREAKING NEWS – City transformed by Candy Crush Soda Saga! Share this sweet news with your friends!\n\nPlay Now --> http://to.king.com/Ht0d","comments":{"0":{"user":"Rafael Adrián Rodríguez-López","message":"We want the Pepper Panic Saga app for android"},"1":{"user":"Jennifer Baker","message":"It's probably why they don't bring pepper panic saga to andriod because the game ends at level 460"},"2":{"user":"Leslie Bell","message":"PLEASE continue the game past level 460!! Do you not hear us!!! Pepper panic has Candy Crush Soda beat by a long way as far as game play!!!"},"3":{"user":"John Fulton","message":"Forget Candy Crush Soda Saga!! We Want More Pepper Panic Saga! This is the Pepper Panic Saga page, not CCSS!!!"},"4":{"user":"Wayne Sal Evans","message":"Breaking news,,, Still waiting for new levels !!!"},"5":{"user":"Jodie Veale","message":"why did Pepper panic just finish?? I suppose this is a question we will never get a response to!"},"6":{"user":"David Pa Mason","message":"They need to come up with another version of Pepper Panic Saga like Bubble Witch Saga did.."},"7":{"user":"Wendy Whitbread","message":"Its so frustrating now pepper panic has finished, soda is nowhere near as good :-("},"8":{"user":"Anne Ahrens","message":"Pepper panic for iPad please"}}},"6":{"shares":68,"likes":25,"message":null,"comments":{"0":{"user":"Betty Nero Przepiora","message":"anyone having problems with this game loading?  I don't have a problem with the other king games"},"1":{"user":"Catherine Pineda","message":"no use of updating the cover photo, when the game ends @ level 460"},"2":{"user":"Tineke Vlieland","message":"New levels please"},"3":{"user":"George Remitrom","message":"Pepper Panic has the perfect balance of levels which are challenging but not impossibly difficult. Also, the levels always feel fresh and never repetitive. I love the variety of the levels. Candy Crush is OK, but has far too many levels which are extremely boring & frustrating, and it lacks the variety of Pepper Panic. I've tried all the other King games and absolutely hated all of them. Why you chose to end the best of all your games is beyond me!"},"4":{"user":"Claire Lock","message":"Why isn't this available for iPad"},"5":{"user":"Karina Pegak","message":"Deberían de poner el juego para jugar en el celular también"},"6":{"user":"Susan Johanson","message":"What a joke! Why is it so hard to put this game on mobile devices and make new levels? You obviously don't care about the 3.4 million fans you have that enjoy playing this game."},"7":{"user":"Wanda Bullock","message":"sorry guys, if the game is canceled I'll be taking it off my list.. have fun while you can.."},"8":{"user":"MaryGarland Tipps-Sumner","message":"So.....you have time to change your cover photo...but you don't have time to continue Panic????"}}},"7":{"shares":93,"likes":25,"message":"The Pepper Panic Saga team just loves this brand new game Candy Crush Soda Saga!\n\nGive it a try, out now on Facebook and mobile! ---> http://to.king.com/0YlS","comments":{"0":{"user":"Shirley Cogswell Johnson","message":"don't like it, want more pepper panic levels!"},"1":{"user":"Pat Pangborn","message":"wish they would of continued more levels with the pepper panic also"},"2":{"user":"Amy Anderson Helton","message":"Please make pepper panic mobile"},"3":{"user":"Belinda Schultz","message":"PLEASE MAKE PEPPER PANIC MOBILE!!!! Pleeeeaaaassseeee!!!"},"4":{"user":"Alonna Torres","message":"When's  pepper panic saga coming to mobile ?"},"5":{"user":"Peg M Pierce","message":"Give us back our Pepper Panic Saga, I quit Candy Crush to play Pepper. I won't go back"},"6":{"user":"Paula Grizzle","message":"Just finished level 460..Please make more pepper panic levels!!..This is my Favorite Game!!"},"7":{"user":"Tinna Lilly Niemann","message":"More levels in pepper panic.\nDon't care about candy crush"},"8":{"user":"Marc Rosell","message":"New soda sucks , more pepper, no new ideas, start a ideas contest with The players."}}},"8":{"shares":28,"likes":25,"message":"You don't want to miss our new game Candy Crush Soda Saga! \n\nPlay now on Facebook - coming soon to mobile! ---> http://to.king.com/2xry","comments":{"0":{"user":"Tinna Lilly Niemann","message":"I'd rather have new pepper panic levels. Candy crush is boring."},"1":{"user":"Kathryn Haynes","message":"Pepper panic please. Why are you putting a new game on android and we are still waiting for Pepper Panic. It can't be difficult."},"2":{"user":"Christian Jay Omero","message":"Are you busy with other King games? Why it stops at 460?"},"3":{"user":"Vibe Ammitzdorf Købsted","message":"Want pepper panic 2 male new levels... Finish at level 460"},"4":{"user":"Emma Brown","message":"When is pepper coming on mobile carnt believe all the other games are on mobile and this int when pepper panic was out well before them taking Mick now"},"5":{"user":"Mary Cruickshank","message":"candy crush soda rubbish dont bother bring back pepper please"},"6":{"user":"Wendie Dunn","message":"Add me please...."},"7":{"user":"Dolores Lawson","message":"Okay you are going to have Candy Crush Soda on mobile and you still haven't gotten Pepper Panic on mobile. Come on I want to play Pepper Painic on mobile"},"8":{"user":"Esteban Antonio Ojeda Torres","message":"I want pepper panic on muy cellphone"}}},"9":{"shares":52,"likes":25,"message":"What are you waiting for? Our newest Episode Loch Macrae is out now! GO GO GO!\nPlay now! ---> http://to.king.com/Cp8r","comments":{"0":{"user":"Jeri Wade","message":"If this is the end of the game you need to post that.  You have a type of cult following for this game & you have a lot of players who are going to be very disappointed if you end it.  WHY??!!  I know you guys usually don't answer posts so I don't expect one here, but I do think you should tell us why you are not continuing this game."},"1":{"user":"Bernadine Higgins","message":"Make it available on android phones and we all will be happy!!!"},"2":{"user":"Trisha Walsh","message":"Just finished pepper panic saga..... AND THERE ARE NO MORE LEVELS????????????????.... SERIOUSLY???????????? Level 460 is the highest????????????? NNNNNNNNOOOOOOOOOO?????????"},"3":{"user":"George Remitrom","message":"You can't end it now! More please. It's the best of all the King games."},"4":{"user":"Luis Poveda","message":"mobile?"},"5":{"user":"Neha Varshney","message":"ples add me"},"6":{"user":"Birgitte Pedersen","message":"add me pls ;)"},"7":{"user":"Guillaume Gautier Rasted","message":"Please Ipad and Iphone !"},"8":{"user":"Ellene K. Medina","message":"Hey! I completed episode Loch Macrae  #460 & that's it. That's the end of the game. This sucks BIG time. Thought I'd let every1 know."}}}}}